Расширения/УХ_ДОП/InformationRegisters/РегистрМатрицыПолномочий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РегистрМатрицыПолномочий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Согласование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныУниверсальныхПроцессов</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Исполняющий</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширения/УХ_ДОП/InformationRegisters/ОтветственныеОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтветственныеОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширения/УХ_ДОП/Enums/СостоянияОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Расширения/УХ_ДОП/CommonModules/РасширениеБизнесЛогикиУХ/Ext/Module.bsl
&Вместо("ПолучитьТекстЗапросаСпискаНастраиваемогоОтчета")
Функция Расш1_ПолучитьТекстЗапросаСпискаНастраиваемогоОтчета()
	РезультатФункции = "";
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда		
		РезультатФункции = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НастраиваемыйОтчет.Ссылка КАК Ссылка,
		|	НастраиваемыйОтчет.ВерсияДанных КАК ВерсияДанных,
		|	НастраиваемыйОтчет.ПометкаУдаления КАК ПометкаУдаления,
		|	НастраиваемыйОтчет.Номер КАК Номер,
		|	НастраиваемыйОтчет.Дата КАК Дата,
		|	НастраиваемыйОтчет.Проведен КАК Проведен,
		|	НастраиваемыйОтчет.Организация КАК Организация,
		|	НастраиваемыйОтчет.Проект КАК Проект,
		|	НастраиваемыйОтчет.ПериодОтчета КАК ПериодОтчета,
		|	НастраиваемыйОтчет.ПериодОкончания КАК ПериодОкончания,
		|	НастраиваемыйОтчет.Сценарий КАК Сценарий,
		|	НастраиваемыйОтчет.ВидОтчета КАК ВидОтчета,
		|	НастраиваемыйОтчет.ШаблонОтчета КАК ШаблонОтчета,
		|	НастраиваемыйОтчет.Аналитика1 КАК Аналитика1,
		|	НастраиваемыйОтчет.Аналитика2 КАК Аналитика2,
		|	НастраиваемыйОтчет.Аналитика3 КАК Аналитика3,
		|	НастраиваемыйОтчет.Аналитика4 КАК Аналитика4,
		|	НастраиваемыйОтчет.Аналитика5 КАК Аналитика5,
		|	НастраиваемыйОтчет.Аналитика6 КАК Аналитика6,
		|	НастраиваемыйОтчет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	НастраиваемыйОтчет.УровеньТочности КАК УровеньТочности,
		|	ЕСТЬNULL(РегистрСостоянийОбъектов.СостояниеОбъекта, ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.ПустаяСсылка)) КАК Состояние,
		|	ПОДСТРОКА(НастраиваемыйОтчет.Комментарий, 1, 1024) КАК Комментарий,
		|	НастраиваемыйОтчет.ОсновнаяВалюта КАК ОсновнаяВалюта,
		|	НастраиваемыйОтчет.ФайлИмпорта КАК ФайлИмпорта,
		|	ЕСТЬNULL(СведенияОбИзмененииДокументов.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИзменения,
		|	НастраиваемыйОтчет.ЧтениеНеактуальныхЗаписей КАК ЧтениеНеактуальныхЗаписей,
		|	НастраиваемыйОтчет.ПравилоОбработки КАК ПравилоОбработки,
		|	НастраиваемыйОтчет.ИспользуемаяИБ КАК ИспользуемаяИБ,
		|	НастраиваемыйОтчет.СпособФормированияОтчета КАК СпособФормированияОтчета,
		|	НастраиваемыйОтчет.БланкИмпорта КАК БланкИмпорта,
		|	НастраиваемыйОтчет.ПравилоПроверки КАК ПравилоПроверки,
		|	НастраиваемыйОтчет.ПериодичностьСвертывания КАК ПериодичностьСвертывания,
		|	НастраиваемыйОтчет.НеВноситьИзменения КАК НеВноситьИзменения,
		|	ЕСТЬNULL(СведенияОбИзмененииДокументов.ПоследнийРедактировавший, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ПоследнийРедактировавший,
		|	НастраиваемыйОтчет.СпособВывода КАК СпособВывода,
		|	РегистрМатрицыПолномочий.Исполняющий КАК Исполнитель,
		|	РегистрМатрицыПолномочий.Согласование КАК Согласование,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрСостоянийОбъектов.СостояниеОбъекта, ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.Запланирован)
		|			ТОГДА 1
		|		КОГДА ЕСТЬNULL(РегистрСостоянийОбъектов.СостояниеОбъекта, ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.Выполняется)
		|			ТОГДА 3
		|		КОГДА ЕСТЬNULL(РегистрСостоянийОбъектов.СостояниеОбъекта, ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.Подготовлен)
		|			ТОГДА 2
		|		КОГДА ЕСТЬNULL(РегистрСостоянийОбъектов.СостояниеОбъекта, ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.Утвержден)
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(РегистрСостоянийОбъектов.СостояниеОбъекта, ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.ЗаписанСОшибкой)
		|			ТОГДА 5
		|		КОГДА ЕСТЬNULL(РегистрСостоянийОбъектов.СостояниеОбъекта, ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.Возвращен)
		|			ТОГДА 4
		|		ИНАЧЕ 5
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НастраиваемыйОтчет.ПометкаУдаления
		|			ТОГДА 6
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НастраиваемыйОтчет.НеВноситьИзменения
		|			ТОГДА 12
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СостояниеГрафика,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрСостоянийОбъектов.СостояниеОбъекта, ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.Подготовлен)
		|			ТОГДА ЛОЖЬ
		|		КОГДА ЕСТЬNULL(РегистрСостоянийОбъектов.СостояниеОбъекта, ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СостоянияОтчетов.Утвержден)
		|			ТОГДА ЛОЖЬ
		|		КОГДА РегистрМатрицыПолномочий.Исполняющий ССЫЛКА Справочник.РолиКонтактныхЛиц
		|				И ОтветственныеОрганизаций_Исполнитель.Пользователь = &ТекущийПользователь
		|			ТОГДА ИСТИНА
		|		КОГДА РегистрМатрицыПолномочий.Исполняющий = &ТекущийПользователь
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИсполняетсяТекущимПользователем,
		|	ВЫБОР
		|		КОГДА ОбработкаЭтаповПроцессаСрез.Ответственный = &ТекущийПользователь
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СогласуетсяТекущимПользователем
		|ИЗ
		|	Документ.НастраиваемыйОтчет КАК НастраиваемыйОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
		|		ПО НастраиваемыйОтчет.ПериодОтчета = УправлениеПериодомСценария.ПериодСценария
		|			И НастраиваемыйОтчет.Сценарий = УправлениеПериодомСценария.Сценарий
		|			И (НЕ УправлениеПериодомСценария.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрМатрицыПолномочий КАК РегистрМатрицыПолномочий
		|		ПО НастраиваемыйОтчет.ВидОтчета = РегистрМатрицыПолномочий.ШаблонДокументаБД
		|			И НастраиваемыйОтчет.Организация = РегистрМатрицыПолномочий.Организация
		|			И (УправлениеПериодомСценария.ВерсияОрганизационнойСтруктуры = РегистрМатрицыПолномочий.ВерсияРегламентаПодготовкиОтчетности)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеОрганизаций КАК ОтветственныеОрганизаций_Исполнитель
		|		ПО (ОтветственныеОрганизаций_Исполнитель.Роль = РегистрМатрицыПолномочий.Исполняющий)
		|			И (ОтветственныеОрганизаций_Исполнитель.Организация = ВЫБОР
		|				КОГДА РегистрМатрицыПолномочий.Исполняющий_Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА НастраиваемыйОтчет.Организация
		|				ИНАЧЕ РегистрМатрицыПолномочий.Исполняющий_Организация
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеОрганизаций КАК ОтветственныеОрганизаций_Согласование
		|		ПО (ОтветственныеОрганизаций_Согласование.Роль = РегистрМатрицыПолномочий.Согласование)
		|			И (ОтветственныеОрганизаций_Согласование.Организация = ВЫБОР
		|				КОГДА РегистрМатрицыПолномочий.Согласование_Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА НастраиваемыйОтчет.Организация
		|				ИНАЧЕ РегистрМатрицыПолномочий.Согласование_Организация
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних(, ) КАК РегистрСостоянийОбъектов
		|		ПО НастраиваемыйОтчет.Ссылка = РегистрСостоянийОбъектов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИзмененииДокументов КАК СведенияОбИзмененииДокументов
		|		ПО НастраиваемыйОтчет.Ссылка = СведенияОбИзмененииДокументов.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов.СрезПоследних(
		|				,
		|				Ответственный = &ТекущийПользователь
		|					И НЕ Выполнено) КАК ОбработкаЭтаповПроцессаСрез
		|		ПО НастраиваемыйОтчет.Ссылка = ОбработкаЭтаповПроцессаСрез.ДокументПроцесса.КлючевойОбъектПроцесса";
	Иначе
		РезультатФункции =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастраиваемыйОтчет.Ссылка КАК Ссылка,
		|	НастраиваемыйОтчет.ВерсияДанных КАК ВерсияДанных,
		|	НастраиваемыйОтчет.ПометкаУдаления КАК ПометкаУдаления,
		|	НастраиваемыйОтчет.Номер КАК Номер,
		|	НастраиваемыйОтчет.Дата КАК Дата,
		|	НастраиваемыйОтчет.Проведен КАК Проведен,
		|	НастраиваемыйОтчет.Организация КАК Организация,
		|	НастраиваемыйОтчет.Проект КАК Проект,
		|	НастраиваемыйОтчет.ПериодОтчета КАК ПериодОтчета,
		|	НастраиваемыйОтчет.Сценарий КАК Сценарий,
		|	НастраиваемыйОтчет.ВидОтчета КАК ВидОтчета,
		|	НастраиваемыйОтчет.ШаблонОтчета КАК ШаблонОтчета,
		|	НастраиваемыйОтчет.Аналитика1 КАК Аналитика1,
		|	НастраиваемыйОтчет.Аналитика2 КАК Аналитика2,
		|	НастраиваемыйОтчет.Аналитика3 КАК Аналитика3,
		|	НастраиваемыйОтчет.Аналитика4 КАК Аналитика4,
		|	НастраиваемыйОтчет.Аналитика5 КАК Аналитика5,
		|	НастраиваемыйОтчет.Аналитика6 КАК Аналитика6,
		|	НастраиваемыйОтчет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	НастраиваемыйОтчет.УровеньТочности КАК УровеньТочности,
		|	НастраиваемыйОтчет.Комментарий КАК Комментарий,
		|	НастраиваемыйОтчет.ОсновнаяВалюта КАК ОсновнаяВалюта,
		|	НастраиваемыйОтчет.ФайлИмпорта КАК ФайлИмпорта,
		|	ЕСТЬNULL(СведенияОбИзмененииДокументов.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИзменения,
		|	НастраиваемыйОтчет.ЧтениеНеактуальныхЗаписей КАК ЧтениеНеактуальныхЗаписей,
		|	НастраиваемыйОтчет.ПравилоОбработки КАК ПравилоОбработки,
		|	НастраиваемыйОтчет.ИспользуемаяИБ КАК ИспользуемаяИБ,
		|	НастраиваемыйОтчет.СпособФормированияОтчета КАК СпособФормированияОтчета,
		|	НастраиваемыйОтчет.БланкИмпорта КАК БланкИмпорта,
		|	НастраиваемыйОтчет.ПравилоПроверки КАК ПравилоПроверки,
		|	НастраиваемыйОтчет.ПериодичностьСвертывания КАК ПериодичностьСвертывания,
		|	НастраиваемыйОтчет.НеВноситьИзменения КАК НеВноситьИзменения,
		|	ЕСТЬNULL(СведенияОбИзмененииДокументов.ПоследнийРедактировавший, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ПоследнийРедактировавший,
		|	НастраиваемыйОтчет.СпособВывода КАК СпособВывода
		|ИЗ
		|	Документ.НастраиваемыйОтчет КАК НастраиваемыйОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
		|		ПО НастраиваемыйОтчет.ПериодОтчета = УправлениеПериодомСценария.ПериодСценария
		|			И НастраиваемыйОтчет.Сценарий = УправлениеПериодомСценария.Сценарий
		|			И (НЕ УправлениеПериодомСценария.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИзмененииДокументов КАК СведенияОбИзмененииДокументов
		|			ПО НастраиваемыйОтчет.Ссылка = СведенияОбИзмененииДокументов.Объект";
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции
